Nuclei-Software/nuclei-sdk/SoC/gd32vw55x/Common/Include/gd32vw55x_qspi.h
/* QSPI_TCFG */
#define QSPI_TCFG_INSTRUCTION             BITS(0,7)                            /*!< command information to be send to the flash memory */
#define QSPI_TCFG_IMOD                    BITS(8,9)                            /*!< instruction mode */
#define QSPI_TCFG_ADDRMOD                 BITS(10,11)                          /*!< address mode */
#define QSPI_TCFG_ADDRSZ                  BITS(12,13)                          /*!< address size */
#define QSPI_TCFG_ALTEMOD                 BITS(14,15)                          /*!< alternate bytes mode */
#define QSPI_TCFG_ALTESZ                  BITS(16,17)                          /*!< alternate bytes size */
#define QSPI_TCFG_DUMYC                   BITS(18,22)                          /*!< number of dummy cycles */
#define QSPI_TCFG_DATAMOD                 BITS(24,25)                          /*!< data mode */
#define QSPI_TCFG_FMOD                    BITS(26,27)                          /*!< functional mode */
#define QSPI_TCFG_SIOO                    BIT(28)                              /*!< send instruction only once */

/* QSPI_ADDR */
#define QSPI_ADDR_ADDR                    BITS(0,31)                           /*!< address to be send to the external flash memory */

/* QSPI_ALTE */
#define QSPI_ALTE_ALTE                    BITS(0,31)                           /*!< optional data to be send to the flash memory */

/* QSPI_DATA */
#define QSPI_DATA_DATA                    BITS(0,31)                           /*!< data to be transferred through the flash memory */

/* QSPI_STATMK */
#define QSPI_STATMK_MASK                  BITS(0,31)                           /*!< status mask */

/* QSPI_STATMATCH */
#define QSPI_STATMATCH_MATCH              BITS(0,31)                           /*!< status match */

/* QSPI_INTERVAL */
#define QSPI_INTERVAL_INTERVAL            BITS(0,15)                           /*!< interval cycle */

/* QSPI_TMOUT */
#define QSPI_TMOUT_TMOUTCYC               BITS(0,15)                           /*!< timeout cycle */

/* QSPI_FLUSH */
#define QSPI_FLUSH_FLUSH                  BIT(0)                               /*!< used to flush all QSPI interval FIFO */

/* constants definitions */
/* QSPI initialize structure definitions */
typedef struct {
    uint32_t prescaler;                                                        /*!< specifies the prescaler factor for generating clock based on the AHB clock.
                                                                                    this parameter can be a number between 0 and 255 */
    uint32_t fifo_threshold;                                                   /*!< specifies the threshold number of bytes in the FIFO (used only in normal mode)
                                                                                    this parameter can be a value between 1 and 16 */
    uint32_t sample_shift;                                                     /*!< specifies the sample shift. the data is sampled 1/2 clock cycle delay later to
                                                                                    take in account external signal delays */
    uint32_t flash_size;                                                       /*!< specifies the flash size. flash_size+1 is effectively the number of address bits
                                                                                    required to address the flash memory. The flash capacity can be up to 4GB
                                                                                    (addressed using 32 bits) in normal mode, but the addressable space in
                                                                                    memory mapped mode is limited to 128MB
                                                                                    this parameter can be a number between 0 and 31 */
    uint32_t cs_high_time;                                                     /*!< specifies the chip select high time. cs_high_time+1 defines the minimum number
                                                                                    of clock cycles which the chip select must remain high between commands */
    uint32_t clock_mode;                                                       /*!< specifies the clock mode. it indicates the level that clock takes between commands */
} qspi_init_struct;

/* QSPI command structure definitions */
typedef struct {
    uint32_t instruction_mode;                                                 /*!< specifies the instruction mode */
    uint32_t instruction;                                                      /*!< specifies the instruction to be sent
                                                                                    this parameter can be a value (8-bit) between 0x00 and 0xFF */
    uint32_t addr_mode;                                                        /*!< specifies the address mode */
    uint32_t addr_size;                                                        /*!< specifies the address size */
    uint32_t addr;                                                             /*!< specifies the address to be sent (Size from 1 to 4 bytes according addr_size)
                                                                                    this parameter can be a value (32-bits) between 0x0 and 0xFFFFFFFF */
    uint32_t altebytes_mode;                                                   /*!< specifies the alternate bytes mode */
    uint32_t altebytes_size;                                                   /*!< specifies the alternate bytes size */
    uint32_t altebytes;                                                        /*!< specifies the alternate Bytes to be sent (size from 1 to 4 bytes according altebytes_size)
                                                                                    this parameter can be a value (32-bits) between 0x0 and 0xFFFFFFFF */
    uint32_t dummycycles;                                                      /*!< specifies the number of dummy cycles.
                                                                                    this parameter can be a number between 0 and 31 */
    uint32_t data_mode;                                                        /*!< specifies the data mode (used for dummy cycles and data phases) */
    uint32_t data_length;                                                      /*!< specifies the number of data to transfer. (this is the number of bytes)
                                                                                    this parameter can be any value between 0 and 0xFFFFFFFF (0 means undefined length
                                                                                    until end of memory) */
    uint32_t sioo_mode;                                                        /*!< specifies the send instruction only once mode */
} qspi_command_struct;

/* QSPI read polling structure definitions */
typedef struct {
    uint32_t match;                                                            /*!< specifies the value to be compared with the masked status register to get a match.
                                                                                    this parameter can be any value between 0 and 0xFFFFFFFF */
    uint32_t mask;                                                             /*!< specifies the mask to be applied to the status bytes received.
                                                                                    this parameter can be any value between 0 and 0xFFFFFFFF */
    uint32_t interval;                                                         /*!< specifies the number of clock cycles between two read during read polling phases.
                                                                                    this parameter can be any value between 0 and 0xFFFF */
    uint32_t statusbytes_size;                                                 /*!< specifies the size of the status bytes received.
                                                                                    this parameter can be any value between 1 and 4 */
    uint32_t match_mode;                                                       /*!< specifies the method used for determining a match. */
    uint32_t polling_stop;                                                     /*!< specifies if read polling is stopped after a match. */
} qspi_polling_struct;

/* QSPI clock mode */
#define QSPI_CLOCK_MODE_0                 ((uint32_t)0x00000000U)              /*!< QSPI clock mode 0 */
#define QSPI_CLOCK_MODE_3                 QSPI_DCFG_CKMOD                      /*!< QSPI clock mode 3 */

/* QSPI sample shift */
#define CTL_SSAMPLE(regval)               (BITS(4,5) & ((uint32_t)(regval) << 4))
#define QSPI_SAMPLE_SHIFTING_NONE         CTL_SSAMPLE(0)                       /*!< no shift when sample data */
#define QSPI_SAMPLE_SHIFTING_HALFCYCLE    CTL_SSAMPLE(1)                       /*!< 1/2 sck cycle shift when sample data */
#define QSPI_SAMPLE_SHIFTING_ONECYCLE     CTL_SSAMPLE(2)                       /*!< one sck cycle shift when sample data */

